const handler = async (m, { conn, usedPrefix: _p }) => {
  try {
    const text = `
*⊱ ───── {※𝙒𝙀𝙇𝘾𝙊𝙈 𝙏𝙊 𝙎.𝙋.𝘾🚀※} ──── ⊰*
            *»»————> اهلا بك في 𝙎.𝙋.𝘾🚀 <————««*

*🎮╍━╍╍━╍═『♞اوامر الالعاب♞』═━╍━╍╍━╍🎮*

*⬤✘⪼.العاب*

*🎗╍━╍━╍═『♞اوامر المشرفين♞』═━╍━╍╍━╍🎗*

*⬤✘⪼.مشرفين*

*🌅╍━╍╍━╍═『♞اوامر الستيكرات♞』═━╍╍━╍━╍🌅*

*⬤✘⪼.ستيكر*

*❄╍╍╍╍═『♞اوامر الذكاء الاصطناعي♞』═━╍╍❄*

*⬤✘⪼.ذكاء*

*☄️╍━╍╍╍═『♞اوامر تحرير الصور♞』═━╍╍╍━╍☄️*

*⬤✘⪼.تعديل*

*⚙️╍━╍╍━╍═『♞اوامر التطبيقات♞』═━╍━╍━╍⚙️*

*⬤✘⪼.تطبيقات*

*⬇️╍━╍━╍╍═『♞اوامر التحميل♞』═━╍━╍━╍╍⬇️*

*⬤✘⪼.تحميل*

*🔖╍╍╍═『♞اوامر الانمي/المانجا/المانهو♞』═━╍╍🔖*

*⬤✘⪼.انمي*

*📿╍━╍╍╍═『♞اوامر الدين الاسلام♞』═━╍╍╍━╍📿*

*⬤✘⪼.دين*

*🔍╍━╍╍━╍═『♞اوامر البحث♞』═━╍━╍╍━╍🔍*

*⬤✘⪼.بحث*

*🌆╍━╍━╍═『♞اوامر تصميم لوغو♞』═━╍━╍╍╍🌆*

*⬤✘⪼.لوغو*

*⚡╍━╍━╍╍═『♞اوامر اخرى♞』═━╍━╍━╍╍⚡*

*⬤✘⪼.اخرى*

*📜╍━╍━╍═『♞معلومات عن البوت♞』═━╍╍━╍╍📜*

*⬤✘⪼.معلومة*

『𝙂𝙊𝙅𝙊-𝘽𝙊𝙏』🤞
`.trim();

    conn.sendMessage(m.chat, {
      text,
      contextInfo: {
        externalAdReply: {
          title: 'GOJO┇BOT',
          body: "البوت الخاص بمملكة SPACE🚀",
          sourceUrl: 'https://www.instagram.com/gojosaturo_876?igsh=amxrYmMydTh0NDN3',
          mediaType: 1,
        }
      }
    }, { quoted: m });
  } catch (e) {
    conn.reply(m.chat, '❎ هناك خطأ في لائحة الاوامر', m);
    throw e;
  }
};

handler.help = ['اوامر'];
handler.tags = ['test'];
handler.command = ['اوامر', 'a', 'order'];
handler.register = false;

export default handler;
