let sendMessage = () => {
  let form = `*⊱ ───── {※𝙒𝙀𝙇𝘾𝙊𝙈 𝙏𝙊 𝙎.𝙋.𝘾🚀※} ──── ⊰*
            *»»————> اهلا بك في 𝙎.𝙋.𝘾🚀 <————««*

*🎮╍━╍╍━╍═『♞اوامر الالعاب♞』═━╍━╍╍━╍🎮*

*⬤✘⪼.العاب*

*🎗╍━╍━╍═『♞اوامر المشرفين♞』═━╍━╍╍━╍🎗*

*⬤✘⪼.مشرفين*

*🌅╍━╍╍━╍═『♞اوامر الستيكرات♞』═━╍╍━╍━╍🌅*

*⬤✘⪼.ستيكر*

*❄╍╍╍╍═『♞اوامر الذكاء الاصطناعي♞』═━╍╍❄*

*⬤✘⪼.ذكاء*

*☄️╍━╍╍╍═『♞اوامر تحرير الصور♞』═━╍╍╍━╍☄️*

*⬤✘⪼.تعديل*

*⚙️╍━╍╍━╍═『♞اوامر التطبيقات♞』═━╍━╍━╍⚙️*

*⬤✘⪼.تطبيقات*

*⬇️╍━╍━╍╍═『♞اوامر التحميل♞』═━╍━╍━╍╍⬇️*

*⬤✘⪼.تحميل*

*🔖╍╍╍═『♞اوامر الانمي/المانجا/المانهو♞』═━╍╍🔖*

*⬤✘⪼.انمي*

*📿╍━╍╍╍═『♞اوامر الدين الاسلام♞』═━╍╍╍━╍📿*

*⬤✘⪼.دين*

*🔍╍━╍╍━╍═『♞اوامر البحث♞』═━╍━╍╍━╍🔍*

*⬤✘⪼.بحث*

*🌆╍━╍━╍═『♞اوامر تصميم لوغو♞』═━╍━╍╍╍🌆*

*⬤✘⪼.لوغو*

*⚡╍━╍━╍╍═『♞اوامر اخرى♞』═━╍━╍━╍╍⚡*

*⬤✘⪼.اخرى*

*📜╍━╍━╍═『♞معلومات عن البوت♞』═━╍╍━╍╍📜*

*⬤✘⪼.معلومة*

『𝙂𝙊𝙅𝙊-𝘽𝙊𝙏』🤞`;

  // Send the form to the designated recipient
  console.log(form);
}

// Call the sendMessage function when the command is received
sendMessage(اوامر);
